DROP TABLE IF EXISTS apex_session;
CREATE TABLE apex_session (
	session_id varchar(10) comment '赛季id',
	session_name varchar(100) comment '赛季名称',
	session_start_time timestamp comment '赛季开始时间',
	session_end_time timestamp comment '赛季结束时间',
	session_desc varchar(500) comment '赛季说明',
	session_color varchar(50) comment '赛季颜色',
	session_img_path varchar(2000) comment '赛季图片',
	primary key(session_id)
) comment 'apex赛季';

INSERT INTO apex_session 
(session_id, session_name, session_start_time, session_end_time, session_desc)
values
('1','狂野边境','2019-03-19','2019-06-18','通行证皮肤哈沃克、新传奇辛烷'),
('2','战斗冲锋','2019-07-02','2019-10-01','通行证皮肤：R301、新传奇华森、新枪L-star、排位赛、寻血猎犬传家宝、辛烷小镇接管、恶灵实验室接管'),
('2.1','铁王冠收集活动','2019-08-03','2019-08-27',''),
('2.2','虚空行者主题活动','2019-09-03','2019-09-17',''),
('3','融化','2019-10-01','2020-02-04','通行证皮肤：和平捍卫者、新传奇密客、地图世界边缘、命脉传家宝、探路者传家宝、幻想游轮接管'),
('3.1','战斗与惊吓收集活动','2019-10-15','2019-11-05',''),
('3.2','圣诞节收集活动','2019-12-02','2020-01-07',''),
('4','同化','2020-02-04','2020-05-12','赛季通行证皮肤：平行步枪、新传奇亡灵、新枪哨兵、辛烷传家宝、寻血猎犬小镇接管'),
('4.1','系统覆盖收集活动','2020-03-03','2020-03-17',''),
('4.2','老地方主题活动','2020-04-7','2020-04-21',''),
('5','财富眷顾','2020-05-12','2020-08-18','赛季通行证皮肤：小帮手、新传奇罗芭、幻象传家宝、密客小镇接管、移动重生信标'),
('5.1','失落的宝座收集活动','2020-06-23','2020-07-07',''),
('6','势不可挡','2020-08-18','2020-11-04','赛季通行证皮肤：G7、新传奇兰伯特、新枪电能冲锋枪、侵蚀传家宝'),
('6.1','售后市场收集活动','2020-10-06','2020-10-20',''),
('7','冲上云霄','2020-11-04','2021-02-02','赛季通行证皮肤：R99、新传奇地平线、新地图奥林匹斯、steam版本、俱乐部、直布罗陀传家宝、探路者拳击馆接管'),
('7.1','战斗之夜收集活动','2021-01-5','2021-01-19',''),
('8','混乱','2021-02-02','2021-05-04','赛季通行证皮肤：长弓精确步枪、新传奇暴雷、新枪30-30中继器、switch版本、班加罗尔传家宝、侵蚀小镇接管'),
('8.1','混沌理论收集活动','2021-03-09','2021-03-23',''),
('9','千古流传','2021-05-04','2021-08-03','赛季通行证皮肤：专注轻机枪、新传奇瓦尔基里、新枪博切克弓、竞技场模式、亡灵传家宝'),
('9.1','创世纪收集活动','2021-06-29','2021-07-13',''),
('10','羽化','2021-08-03','2021-11-02','赛季通行证皮肤：电能冲锋枪、新传奇希尔、新枪狂暴轻机枪、竞技场排位赛、兰伯特传家宝、兰伯特改装店接管'),
('10.1','进化收集活动','2021-09-14','2021-09-28',''),
('11','逃脱隐世','2021-11-02','2022-02-08','赛季通行证皮肤：猎手冲锋枪、新传奇艾许、新枪car、新地图风暴点、华森传家宝'),
('11.1','突袭者收集活动','2021-12-07','2022-02-01',''),
('12','反抗','2022-02-08','2022-05-10','赛季通行证皮肤：汗洛、新传奇疯玛吉、寻血猎犬威望皮肤'),
('12.1','三周年收集活动','2022-02-15','2022-03-01','')
;
